; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-18)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city11)
	(fuel-level plane1 fl0)
	(at plane2 city0)
	(fuel-level plane2 fl3)
	(at plane3 city3)
	(fuel-level plane3 fl4)
	(at plane4 city16)
	(fuel-level plane4 fl3)
	(at plane5 city15)
	(fuel-level plane5 fl5)
	(at plane6 city0)
	(fuel-level plane6 fl2)
	(at plane7 city5)
	(fuel-level plane7 fl3)
	(at person1 city0)
	(at person2 city13)
	(at person3 city12)
	(at person4 city13)
	(at person5 city4)
	(at person6 city13)
	(at person7 city18)
	(at person8 city5)
	(at person9 city11)
	(at person10 city16)
	(at person11 city14)
	(at person12 city5)
	(at person13 city9)
	(at person14 city15)
	(at person15 city19)
	(at person16 city5)
	(at person17 city0)
	(at person18 city1)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane4 city11)
	(at plane6 city13)
	(at plane7 city7)
	(at person1 city0)
	(at person2 city3)
	(at person3 city9)
	(at person4 city3)
	(at person5 city8)
	(at person6 city16)
	(at person7 city16)
	(at person8 city5)
	(at person9 city8)
	(at person10 city4)
	(at person11 city4)
	(at person12 city18)
	(at person13 city10)
	(at person14 city4)
	(at person15 city9)
	(at person16 city2)
	(at person17 city1)
	(at person18 city7)
	))

)

; plan
1. (zoom plane7 city5 city13 fl3 fl2 fl1)
   deleted: (at plane7 city5) (fuel-level plane7 fl3)
   added: (at plane7 city13) (fuel-level plane7 fl1)
   goals met: 2 of 21
2. (board person6 plane7 city13)
   deleted: (at person6 city13)
   added: (in person6 plane7)
   goals met: 2 of 21
3. (board person4 plane7 city13)
   deleted: (at person4 city13)
   added: (in person4 plane7)
   goals met: 2 of 21
4. (board person2 plane7 city13)
   deleted: (at person2 city13)
   added: (in person2 plane7)
   goals met: 2 of 21
5. (zoom plane6 city0 city13 fl2 fl1 fl0)
   deleted: (at plane6 city0) (fuel-level plane6 fl2)
   added: (at plane6 city13) (fuel-level plane6 fl0)
   goals met: 3 of 21
6. (board person14 plane5 city15)
   deleted: (at person14 city15)
   added: (in person14 plane5)
   goals met: 3 of 21
7. (zoom plane5 city15 city4 fl5 fl4 fl3)
   deleted: (at plane5 city15) (fuel-level plane5 fl5)
   added: (at plane5 city4) (fuel-level plane5 fl3)
   goals met: 3 of 21
8. (board person5 plane5 city4)
   deleted: (at person5 city4)
   added: (in person5 plane5)
   goals met: 3 of 21
9. (debark person14 plane5 city4)
   deleted: (in person14 plane5)
   added: (at person14 city4)
   goals met: 4 of 21
10. (zoom plane5 city4 city8 fl3 fl2 fl1)
   deleted: (at plane5 city4) (fuel-level plane5 fl3)
   added: (at plane5 city8) (fuel-level plane5 fl1)
   goals met: 4 of 21
11. (debark person5 plane5 city8)
   deleted: (in person5 plane5)
   added: (at person5 city8)
   goals met: 5 of 21
12. (zoom plane4 city16 city11 fl3 fl2 fl1)
   deleted: (at plane4 city16) (fuel-level plane4 fl3)
   added: (at plane4 city11) (fuel-level plane4 fl1)
   goals met: 6 of 21
13. (board person9 plane4 city11)
   deleted: (at person9 city11)
   added: (in person9 plane4)
   goals met: 6 of 21
14. (board person17 plane2 city0)
   deleted: (at person17 city0)
   added: (in person17 plane2)
   goals met: 6 of 21
15. (zoom plane2 city0 city1 fl3 fl2 fl1)
   deleted: (at plane2 city0) (fuel-level plane2 fl3)
   added: (at plane2 city1) (fuel-level plane2 fl1)
   goals met: 6 of 21
16. (board person18 plane2 city1)
   deleted: (at person18 city1)
   added: (in person18 plane2)
   goals met: 6 of 21
17. (debark person17 plane2 city1)
   deleted: (in person17 plane2)
   added: (at person17 city1)
   goals met: 7 of 21
18. (fly plane2 city1 city7 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city7) (fuel-level plane2 fl0)
   goals met: 7 of 21
19. (debark person18 plane2 city7)
   deleted: (in person18 plane2)
   added: (at person18 city7)
   goals met: 8 of 21
20. (fly plane7 city13 city3 fl1 fl0)
   deleted: (at plane7 city13) (fuel-level plane7 fl1)
   added: (at plane7 city3) (fuel-level plane7 fl0)
   goals met: 8 of 21
21. (refuel plane7 city3 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 8 of 21
22. (debark person4 plane7 city3)
   deleted: (in person4 plane7)
   added: (at person4 city3)
   goals met: 9 of 21
23. (debark person2 plane7 city3)
   deleted: (in person2 plane7)
   added: (at person2 city3)
   goals met: 10 of 21
24. (fly plane7 city3 city16 fl1 fl0)
   deleted: (at plane7 city3) (fuel-level plane7 fl1)
   added: (at plane7 city16) (fuel-level plane7 fl0)
   goals met: 10 of 21
25. (refuel plane7 city16 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 10 of 21
26. (debark person6 plane7 city16)
   deleted: (in person6 plane7)
   added: (at person6 city16)
   goals met: 11 of 21
27. (board person10 plane7 city16)
   deleted: (at person10 city16)
   added: (in person10 plane7)
   goals met: 11 of 21
28. (fly plane7 city16 city4 fl1 fl0)
   deleted: (at plane7 city16) (fuel-level plane7 fl1)
   added: (at plane7 city4) (fuel-level plane7 fl0)
   goals met: 11 of 21
29. (refuel plane7 city4 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 11 of 21
30. (debark person10 plane7 city4)
   deleted: (in person10 plane7)
   added: (at person10 city4)
   goals met: 12 of 21
31. (fly plane7 city4 city7 fl1 fl0)
   deleted: (at plane7 city4) (fuel-level plane7 fl1)
   added: (at plane7 city7) (fuel-level plane7 fl0)
   goals met: 13 of 21
32. (zoom plane3 city3 city12 fl4 fl3 fl2)
   deleted: (at plane3 city3) (fuel-level plane3 fl4)
   added: (at plane3 city12) (fuel-level plane3 fl2)
   goals met: 13 of 21
33. (board person3 plane3 city12)
   deleted: (at person3 city12)
   added: (in person3 plane3)
   goals met: 13 of 21
34. (zoom plane3 city12 city9 fl2 fl1 fl0)
   deleted: (at plane3 city12) (fuel-level plane3 fl2)
   added: (at plane3 city9) (fuel-level plane3 fl0)
   goals met: 13 of 21
35. (debark person3 plane3 city9)
   deleted: (in person3 plane3)
   added: (at person3 city9)
   goals met: 14 of 21
36. (board person13 plane3 city9)
   deleted: (at person13 city9)
   added: (in person13 plane3)
   goals met: 14 of 21
37. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 14 of 21
38. (fly plane3 city9 city10 fl1 fl0)
   deleted: (at plane3 city9) (fuel-level plane3 fl1)
   added: (at plane3 city10) (fuel-level plane3 fl0)
   goals met: 14 of 21
39. (debark person13 plane3 city10)
   deleted: (in person13 plane3)
   added: (at person13 city10)
   goals met: 15 of 21
40. (fly plane4 city11 city8 fl1 fl0)
   deleted: (at plane4 city11) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 14 of 21
41. (refuel plane4 city8 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 14 of 21
42. (debark person9 plane4 city8)
   deleted: (in person9 plane4)
   added: (at person9 city8)
   goals met: 15 of 21
43. (fly plane4 city8 city14 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 15 of 21
44. (refuel plane4 city14 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 15 of 21
45. (board person11 plane4 city14)
   deleted: (at person11 city14)
   added: (in person11 plane4)
   goals met: 15 of 21
46. (fly plane4 city14 city11 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 16 of 21
47. (refuel plane4 city11 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 16 of 21
48. (fly plane5 city8 city18 fl1 fl0)
   deleted: (at plane5 city8) (fuel-level plane5 fl1)
   added: (at plane5 city18) (fuel-level plane5 fl0)
   goals met: 16 of 21
49. (board person7 plane5 city18)
   deleted: (at person7 city18)
   added: (in person7 plane5)
   goals met: 16 of 21
50. (refuel plane5 city18 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 16 of 21
51. (fly plane5 city18 city19 fl1 fl0)
   deleted: (at plane5 city18) (fuel-level plane5 fl1)
   added: (at plane5 city19) (fuel-level plane5 fl0)
   goals met: 16 of 21
52. (refuel plane5 city19 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 16 of 21
53. (board person15 plane5 city19)
   deleted: (at person15 city19)
   added: (in person15 plane5)
   goals met: 16 of 21
54. (fly plane5 city19 city16 fl1 fl0)
   deleted: (at plane5 city19) (fuel-level plane5 fl1)
   added: (at plane5 city16) (fuel-level plane5 fl0)
   goals met: 16 of 21
55. (refuel plane5 city16 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 16 of 21
56. (debark person7 plane5 city16)
   deleted: (in person7 plane5)
   added: (at person7 city16)
   goals met: 17 of 21
57. (fly plane5 city16 city5 fl1 fl0)
   deleted: (at plane5 city16) (fuel-level plane5 fl1)
   added: (at plane5 city5) (fuel-level plane5 fl0)
   goals met: 17 of 21
58. (refuel plane5 city5 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 17 of 21
59. (board person16 plane5 city5)
   deleted: (at person16 city5)
   added: (in person16 plane5)
   goals met: 17 of 21
60. (board person12 plane5 city5)
   deleted: (at person12 city5)
   added: (in person12 plane5)
   goals met: 17 of 21
61. (fly plane5 city5 city18 fl1 fl0)
   deleted: (at plane5 city5) (fuel-level plane5 fl1)
   added: (at plane5 city18) (fuel-level plane5 fl0)
   goals met: 17 of 21
62. (refuel plane5 city18 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 17 of 21
63. (debark person12 plane5 city18)
   deleted: (in person12 plane5)
   added: (at person12 city18)
   goals met: 18 of 21
64. (fly plane5 city18 city2 fl1 fl0)
   deleted: (at plane5 city18) (fuel-level plane5 fl1)
   added: (at plane5 city2) (fuel-level plane5 fl0)
   goals met: 18 of 21
65. (refuel plane5 city2 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 18 of 21
66. (debark person16 plane5 city2)
   deleted: (in person16 plane5)
   added: (at person16 city2)
   goals met: 19 of 21
67. (fly plane5 city2 city9 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 19 of 21
68. (debark person15 plane5 city9)
   deleted: (in person15 plane5)
   added: (at person15 city9)
   goals met: 20 of 21
69. (fly plane4 city11 city4 fl1 fl0)
   deleted: (at plane4 city11) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 19 of 21
70. (refuel plane4 city4 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 19 of 21
71. (debark person11 plane4 city4)
   deleted: (in person11 plane4)
   added: (at person11 city4)
   goals met: 20 of 21
72. (fly plane4 city4 city11 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 21 of 21
